/*
-------------------------------------------------------------
3. Вывести число студентов ФКТИУ, которые не имеет отчества.
Ответ должен содержать только одно число.
-------------------------------------------------------------
 */

 SELECT count("Н_ЛЮДИ") FROM "Н_ЛЮДИ" INNER JOIN "Н_ОБУЧЕНИЯ"
    ON ("Н_ЛЮДИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД") AND
       (("Н_ЛЮДИ"."ОТЧЕСТВО" = '.') OR ("Н_ЛЮДИ"."ОТЧЕСТВО" IS NULL)) INNER JOIN "Н_УЧЕНИКИ"
           ON "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД" INNER JOIN "Н_ПЛАНЫ"
               ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ПЛАН_ИД" INNER JOIN "Н_ОТДЕЛЫ"
                   ON ("Н_ПЛАНЫ"."ОТД_ИД" = "Н_ОТДЕЛЫ"."ОТД_ИД") AND ("Н_ОТДЕЛЫ"."ОТД_ИД" = 703);