/*
-------------------------------------------------------------
5. Выведите таблицу со средними оценками студентов группы 4100 (Номер, ФИО, Ср_оценка),
у которых средняя оценка (равна по заданию) больше (чтобы выводилось хоть что-то) минимальной оценк(е|и) в группе 3100.
-------------------------------------------------------------
 */

 SELECT "Н_ЛЮДИ"."ИД", "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО", AVG("Н_ВЕДОМОСТИ"."ОЦЕНКА" :: INT) FROM "Н_ЛЮДИ" INNER JOIN "Н_ОБУЧЕНИЯ"
    ON "Н_ЛЮДИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" INNER JOIN "Н_УЧЕНИКИ"
        ON ("Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД")
            AND ("Н_УЧЕНИКИ"."ГРУППА" = '4100') INNER JOIN "Н_ВЕДОМОСТИ"
                ON ("Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД")
                    AND ("Н_ВЕДОМОСТИ"."ОЦЕНКА" NOT IN ('осв', 'неявка', 'незач', 'зачет', '99'))
                        GROUP BY "Н_ЛЮДИ"."ИД", "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО" HAVING AVG("Н_ВЕДОМОСТИ"."ОЦЕНКА" :: int) >
                            (SELECT MIN("Н_ВЕДОМОСТИ"."ОЦЕНКА" :: INT) FROM "Н_ВЕДОМОСТИ" INNER JOIN "Н_ЛЮДИ"
                                ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД" INNER JOIN "Н_ОБУЧЕНИЯ"
                                    ON "Н_ЛЮДИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" INNER JOIN "Н_УЧЕНИКИ"
                                        ON ("Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД")
                                            AND ("Н_УЧЕНИКИ"."ГРУППА" = '3100') AND ("Н_ВЕДОМОСТИ"."ОЦЕНКА") NOT IN ('осв', 'неявка', 'незач', 'зачет', '99'))
                                                ORDER BY AVG("Н_ВЕДОМОСТИ"."ОЦЕНКА" :: INT) DESC